[{"jobs":{"abstract":"Gadget Co. was established in 1987, and remains one of the largest international widget manufacturers.  We have solid career opportunities, and are looking for quality employees that will share in our success.","archived":0,"city":"Portland","company":"Gagdet Co.","country":"United States","created_at":"2012-04-02T16:01:44-07:00","description":"The Sales Associate will develop sales programs, implement strategies, set targets and prepare an annual budget.  This position will report to the Sales Director. In addition, the Sales Associate will provide information about the products and services of the company to it's clients in order to increase the sales of the company, and provide support in developing long-term relationships with the clients. Some other duties of a sales associate are assisting in the development and execution of sales programs, and supporting the technical team by providing the details of requirements of the customers.\r\n\r\nSome of the duties and responsibilities of a sales associate are:\r\n\r\n  *   Should have full knowledge of customers and product.\r\n\r\n  *   Keeping the focus on customers planning the sales strategies and setting targets.\r\n\r\n * Directing and coordinating the marketing team with valuable information about the customers and product.\r\n\r\n* Making the product  visible in the market through publications, events and networking relations.\r\n\r\n *    Providing the management with research inputs, creative solutions and ideas. Developing sales plans and reporting the details of its implementation to the management.\r\n\r\n *    Participating in events, trade fairs, campaigns and conferences relating to the product or industry.\r\n\r\n *    Estimating customers on quotes quickly and accurately.\r\n\r\n *    Providing with leads for follow-up to the senior executives of company.\r\n\r\n *    Renew the existing accounts of customers with required details of service or pricing.\r\n\r\n *    Working with current clients in finding opportunities for new customers that may have a need for our products\r\n\r\n *    Maintain customer database for associated mailings, development, and marketing outreach opportunities\r\n\r\n *   Prepare renewal contracts and quotes for existing clients.\r\n\r\n *    Working on special projects with the team or as a part of team.\r\n\r\n *    Collecting feedback from clients to access possible improvements to existing products and also the need for new products.\r\n\r\n*     Provide the management with sales quotes.\r\n\r\nSome additional skills required of the applicant are the ability to function within a team environment or independently, having the ability to determine prospective customers, should be a self-starter, possess good organizational and management skills, have customer service experience, ability to understand the client’s business needs and address their problems, possess good communication skills, both oral and written, and the ability to develop and maintain good relationships with clients.\r\n\r\nEducational qualifications required for the post are a bachelor’s degree in Sales and Marketing or related field, and sound knowledge of business organization's needs and activities, as well as 1-2 years of experience in sales related field.\r\n\r\n","id":294,"job_code":"1121","state":"OR","title":"Account Executive","url":"http://ht-jobs.net/OOGSA0J"}},{"jobs":{"abstract":"Looking for qualified web developers to take our business to the next level","archived":1,"city":"Portland","company":"Gagdet Co.","country":"United States","created_at":"2012-04-30T13:03:07-07:00","description":"Web developers will work with the business and editorial departments to constantly improve our website and newspaper. The job is a combination of different web disciplines: part development, part operations, and part design. The ideal candidate will have a wide range of web skills, but does not need to be a master of all.\r\n\r\nDevelopers will be responsible for limited scope web design and development serving both our internal operations and external sites. Development projects will focus on identifying and solving specific problems. For projects of a larger scope, developers will work with outside vendors to do the development and design work. Developer will also be responsible for applying patches on the software level of the web stack and troubleshooting problems on the site. Developers must also have an eagerness to learn about new technologies and share that knowledge with the rest of the staff.\r\n\r\n*  Reports to Director of Technology\r\n\r\nDuties &amp; Responsibilities:\r\n\r\n*  Identify and meet technology needs of editorial and business operations.\r\n*  Build, or work with outside firms to build websites and web-based tools.\r\n*  Work with outside hosting providers and developers to implement website upgrades.\r\n*  Monitor web operations and respond to problems, some of which occur outside of regular business hours.\r\n*  Share knowledge of internet techniques and technologies with our staff.\r\n*  Train and support our staff on the best ways to utilize our internal tools.\r\n*  Work with an external help desk that handles desktop hardware and software.\r\n*  Additional duties as assigned.\r\n\r\nRequired Qualifications &amp; Skills:\r\n\r\n*  Excellent written and verbal communication skills.\r\n*  Ability to work independently.\r\n*  Familiarity with web APIs and development frameworks.\r\n*  Well-rounded knowledge of web serving and desktop computing needs.\r\n*  Experience developing web applications in: PHP, Python, PERL, Ruby, Django, Rails, .net or similar environment.\r\n*  Experience with Movable Type.\r\n*  Experience with HTML, CSS and user interface design.\r\n*  Familiarity with using version control systems.\r\n*  Journalism or advertising experience also a plus.","id":339,"job_code":"4324","state":"OR","title":"Web Developer","url":"http://ht-jobs.net/04Q3WFA"}},{"jobs":{"abstract":"Responsible for planning, processing and performing all jobs in an efficient manner with no assistan...","archived":0,"city":"Portland","company":"Gagdet Co.","country":"United States","created_at":"2012-05-07T10:21:25-07:00","description":"Responsible for planning, processing and performing all jobs in an efficient manner with no assistance from the supervisor\r\n\r\nWorking closely with upper management.\r\n\r\nDesign and develop programming systems making specific determinations about system performance.\r\n\r\nResponding promptly and professionally to bug reports.\r\n\r\nReview and repair legacy code.\r\n\r\nExpected to conduct system analysis and development, with limited support from professional staff, to keep our systems current with changing technologies.\r\n\r\nAnalyze, design, coordinate and supervise the development of software systems to form a basis for the solution of information processing problems.\r\n\r\nAnalyze system specifications and translate system requirements to task specifications for junior programmers.\r\n\r\nResponsible for analysis of current programs including performance, diagnosis and troubleshooting of problem programs, and designing solutions to problematic programming.\r\n\r\nResponsible for developing new programs and proofing the program to develop needed changes to assure production of a quality product.\r\n\r\nResponsible for development of new programs, analyzes current programs and processes, and making recommendations which yield a more cost effective product.\r\n\r\nWrites, edits, and debugs new computer programs for assigned projects, including necessary records and desired output.\r\n\r\nTests new programs to ensure that logic and syntax are correct, and that program results are accurate; assists lower-level programmers with programming assignments.\r\n\r\nDocument code consistently throughout the development process by listing a description of the program, special instructions, and any changes made in database tables on procedural, modular and database level.\r\n\r\nResponsible for reading, understanding, and utilizing all part and assembly prints, forms, spreadsheets, bills of material, specification sheets, and technical references.\r\n\r\nResponsible for utilizing tools and equipment involved in performance of essential functions of programming including measuring instruments.\r\n\r\nSearch, summarize and keep the team abreast of strategic information from all sources\r\n\r\nMaintain client databases\r\n\r\nCapable of writing proposals or papers.\r\n\r\nMaking presentations to customer or client audiences or professional peers.\r\n\r\nMaintain positive client interactions.\r\n\r\nStrong and effective inter-personal and communication skills and the ability to interact professionally with a diverse group of clients and staff.\r\n\r\nResponsible for communicating with engineers and manufacturer's technical support staff regarding programming needs and performance.\r\n\r\nProvide general administrative support to the organization\r\n\r\nProvide feedback to analysis/training staff about performance considerations / usability issues concerning software specifications and implementation.\r\n\r\nResearch and recommend software tools to management.\r\n\r\nProvide assistance to testers and support personnel as needed to determine system problems.\r\n\r\nReview, to the extent possible, changes in code and the environment that will affect system performance.\r\n\r\nProvide recommendations to management concerning issues of programmer productivity and software development management.\r\n\r\nAdditional skills and/or areas of expertise:\r\n\r\nAbility to solve problems quickly and completely.\r\n\r\nAbility to identify tasks which require automation and automate them.\r\n\r\nA solid understanding of networking/distributed computing environment concepts.\r\n\r\nSolid understanding the principles of routing, client/server programming.\r\n\r\nPossess excellent communication skills, with an emphasis on verbal and written communication.\r\n\r\nAbility to multi-task and stay organized in a dynamic work environment.\r\n\r\nPossess a positive attitude.\r\n\r\nAbility to \"think outside the box\".\r\n\r\nConsult with the Lead Programmer and the Technical Manager regarding professional skill development.\r\n\r\nPrepare reports and analyses setting forth progress, adverse trends and appropriate recommendations or conclusions.\r\n\r\nParticipate in development of long range planning for new projects and facilities.\r\n\r\nExperience and ability to teach or instruct co-workers.\r\n\r\nProviding advice, training and technical support for various projects.\r\n\r\nWorking closely with management team in evaluating current systems and making decisions on future development.\r\n\r\nPossess extremely advanced technical skills.\r\n\r\nAs new technologies emerge and impact our systems, expected to learn these technologies very quickly and resolve any problems involved in integrating new technologies with our systems.\r\n\r\nExpert knowledge of computer languages.\r\n\r\nExpert knowledge of data structures.\r\n\r\nExpert knowledge of computer logic and flow-charting.\r\n\r\nExpert knowledge of computer program design methods and techniques.\r\n\r\nExpert knowledge of all database vendor versions.\r\n\r\nExpert knowledge of all compiler versions.\r\n\r\nAbility to learn new programming languages quickly.\r\n\r\nGood knowledge of mathematical and statistical principles and formulas.\r\n\r\nAssists the Programmer Analysts in designing programs and databases.\r\n\r\nAbility to write, edit, and debug computer programs to achieve desired output.\r\n\r\nAbility to work productively in a team.\r\n\r\nExpert knowledge of maintaining and debugging live software systems.\r\n\r\nExpert knowledge of writing program documentation.\r\n\r\nIn-depth technical knowledge of the current hardware.\r\n\r\nExpert knowledge of used operating systems.\r\n\r\nExpert knowledge of standard development tools.\r\n\r\nExpert knowledge of networking technologies from the programmers prospective.\r\n\r\nAbility to determine whether a particular problem is caused by hardware, operating systems software, application programs, or network failures.\r\n\r\nGood knowledge of security and encryption.\r\n\r\nUpdates and modifies computer programs to improve efficiency.\r\n\r\nPerforms work of high difficulty in designing, writing, editing, modifying, and debugging computer programs.\r\n\r\nDefine functional specifications of the system for the appropriate hardware.\r\n\r\nExpert knowledge of component writing.\r\n\r\nDemonstrated ability to use standard computing tools: Word processor, spreadsheet, browser, email, and file compression software.\r\n\r\nOverall knowledge of the computing environment at large, e.g. typical uses and user populations of operating systems, communications protocols, hardware platforms, etc.\r\n\r\nPerform other related duties incidental to the work described herein in support of the company.\r\n\r\n ","id":349,"job_code":"1185","state":"OR","title":"Senior Copywriter","url":"http://ht-jobs.net/QRTNIOH"}},{"jobs":{"abstract":"this is a collection pool of c++ programmers for future consideration","archived":0,"city":"Portland","company":"Gagdet Co.","country":"United States","created_at":"2012-05-14T15:20:14-07:00","description":"this is a collection pool of c++ programmers for future consideration","id":357,"job_code":"","state":"OR","title":"c++ programmers","url":"http://ht-jobs.net/4DB18BM"}},{"jobs":{"abstract":"Responsible to profitably grow sales to achieve yearly sales goals by maintaining and increasing opportunities with existing core customers and prospecting new accounts.","archived":0,"city":"Portland","company":"Gagdet Co.","country":"United States","created_at":"2012-07-27T19:23:04-07:00","description":"Job Duties &amp; Responsibilities\r\n\r\nManage sales volume in local territory with existing customers while prospecting successfully to expand local customer base; able to properly assess the needs of and qualify each prospect and provide customers with the high quality service they expect.\r\n\r\nMeet or exceed sales objectives through effective partnerships with property managers, REIT’s and apartment owners by promoting and selling floor covering products and installation using professional sales techniques and product services.\r\n\r\nDevelop and sustain sales relationships with key decision makers and influencers within an organization.\r\n\r\nDevelop and implement sales business plans to expand business presence within assigned territory. Share market and competitor information with all applicable channels within the organization; establish relationships and working partnerships internally.\r\n\r\nResearch, develop and acquire account opportunities within targeted local market.\r\n\r\nProblem solving and trouble shooting while effectively managing long term customer relationships and managing company risk.\r\n\r\nParticipate in local and national trade associations and conferences.\r\n\r\nJob Qualifications\r\n\r\nTypically requires BS/BA in business or related discipline. Ability to increase profitable new business with existing customers. 2-5 years of experience with consultative/solution based business-to-business selling.\r\n\r\nExperience selling into the multi-family industry helpful, but not required.\r\n\r\nRequires increasing independence; receives guidance mainly on complex or unusual problems or issues with periodic review of output by sales manager or direct “customers” of the process.\r\n\r\nAbility to analyze situations and bring successful resolution to complex and/or cross department problems and to reach sound decisions under conditions of uncertainty.\r\n\r\nComputer savvy with experience using Salesforce or another CRM program.","id":661,"job_code":"","state":"OR","title":"Account Executive","url":"http://ht-jobs.net/B3HWPIQ"}}]