[{"id":294,"company":"Gagdet Co.","job_code":"1121","title":"Account Executive","abstract":"Gadget Co. was established in 1987, and remains one of the largest international widget manufacturers.  We have solid career opportunities, and are looking for quality employees that will share in our success.","description":"The Sales Associate will develop sales programs, implement strategies, set targets and prepare an annual budget.  This position will report to the Sales Director. In addition, the Sales Associate will provide information about the products and services of the company to it's clients in order to increase the sales of the company, and provide support in developing long-term relationships with the clients. Some other duties of a sales associate are assisting in the development and execution of sales programs, and supporting the technical team by providing the details of requirements of the customers.\r\n\r\nSome of the duties and responsibilities of a sales associate are:\r\n\r\n  *   Should have full knowledge of customers and product.\r\n\r\n  *   Keeping the focus on customers planning the sales strategies and setting targets.\r\n\r\n * Directing and coordinating the marketing team with valuable information about the customers and product.\r\n\r\n* Making the product  visible in the market through publications, events and networking relations.\r\n\r\n *    Providing the management with research inputs, creative solutions and ideas. Developing sales plans and reporting the details of its implementation to the management.\r\n\r\n *    Participating in events, trade fairs, campaigns and conferences relating to the product or industry.\r\n\r\n *    Estimating customers on quotes quickly and accurately.\r\n\r\n *    Providing with leads for follow-up to the senior executives of company.\r\n\r\n *    Renew the existing accounts of customers with required details of service or pricing.\r\n\r\n *    Working with current clients in finding opportunities for new customers that may have a need for our products\r\n\r\n *    Maintain customer database for associated mailings, development, and marketing outreach opportunities\r\n\r\n *   Prepare renewal contracts and quotes for existing clients.\r\n\r\n *    Working on special projects with the team or as a part of team.\r\n\r\n *    Collecting feedback from clients to access possible improvements to existing products and also the need for new products.\r\n\r\n*     Provide the management with sales quotes.\r\n\r\nSome additional skills required of the applicant are the ability to function within a team environment or independently, having the ability to determine prospective customers, should be a self-starter, possess good organizational and management skills, have customer service experience, ability to understand the client’s business needs and address their problems, possess good communication skills, both oral and written, and the ability to develop and maintain good relationships with clients.\r\n\r\nEducational qualifications required for the post are a bachelor’s degree in Sales and Marketing or related field, and sound knowledge of business organization's needs and activities, as well as 1-2 years of experience in sales related field.\r\n\r\n","city":"Portland","state":"OR","country":"United States","archived":0,"url":"http://ht-jobs.net/OOGSA0J","created_at":"2012-04-02T16:01:44-07:00"},{"id":357,"company":"Gagdet Co.","job_code":"","title":"c++ programmers","abstract":"this is a collection pool of c++ programmers for future consideration","description":"this is a collection pool of c++ programmers for future consideration","city":"Portland","state":"OR","country":"United States","archived":0,"url":"http://ht-jobs.net/4DB18BM","created_at":"2012-05-14T15:20:14-07:00"}]