[{"id":339,"company":"Gagdet Co.","job_code":"4324","title":"Web Developer","abstract":"Looking for qualified web developers to take our business to the next level","description":"Web developers will work with the business and editorial departments to constantly improve our website and newspaper. The job is a combination of different web disciplines: part development, part operations, and part design. The ideal candidate will have a wide range of web skills, but does not need to be a master of all.\r\n\r\nDevelopers will be responsible for limited scope web design and development serving both our internal operations and external sites. Development projects will focus on identifying and solving specific problems. For projects of a larger scope, developers will work with outside vendors to do the development and design work. Developer will also be responsible for applying patches on the software level of the web stack and troubleshooting problems on the site. Developers must also have an eagerness to learn about new technologies and share that knowledge with the rest of the staff.\r\n\r\n*  Reports to Director of Technology\r\n\r\nDuties &amp; Responsibilities:\r\n\r\n*  Identify and meet technology needs of editorial and business operations.\r\n*  Build, or work with outside firms to build websites and web-based tools.\r\n*  Work with outside hosting providers and developers to implement website upgrades.\r\n*  Monitor web operations and respond to problems, some of which occur outside of regular business hours.\r\n*  Share knowledge of internet techniques and technologies with our staff.\r\n*  Train and support our staff on the best ways to utilize our internal tools.\r\n*  Work with an external help desk that handles desktop hardware and software.\r\n*  Additional duties as assigned.\r\n\r\nRequired Qualifications &amp; Skills:\r\n\r\n*  Excellent written and verbal communication skills.\r\n*  Ability to work independently.\r\n*  Familiarity with web APIs and development frameworks.\r\n*  Well-rounded knowledge of web serving and desktop computing needs.\r\n*  Experience developing web applications in: PHP, Python, PERL, Ruby, Django, Rails, .net or similar environment.\r\n*  Experience with Movable Type.\r\n*  Experience with HTML, CSS and user interface design.\r\n*  Familiarity with using version control systems.\r\n*  Journalism or advertising experience also a plus.","city":"Portland","state":"OR","country":"United States","archived":1,"url":"http://ht-jobs.net/04Q3WFA","created_at":"2012-04-30T13:03:07-07:00"}]